%---------------------------------------------%
%					      %
%          工作室提供代做matlab仿真	      %
%					      %
%  详情请访问：http://cn.mikecrm.com/5k6v1DP  %
%					      %
%---------------------------------------------%
function dy = state4(t,y);

global  b c m_0 d L p g y_og
dy=zeros(6,1);
y_og=0;
dy(1)=y(4);
dy(2)=y(5);
dy(3)=y(6);
dy(4)=(-sign(y(4))*0.1*(y(4))^2)/(d*m_0);
dy(5)=(-sign(y(5))*0.1*(y(5))^2)/(d*m_0)-g ;
dy(6)=((sign(y(4))*0.1*(y(4))^2*sin((y(3))*pi/180)-sign(y(5))*0.1*(y(5))^2*cos((y(3))*pi/180))*y_og)/(m_0*d*(L^2/12));
      
      